IDEA Open Model
OpenModel.HingeElement1D Property
Compatible with IDEA StatiCa v 10.1
 List of hinge elements 1D
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public List<HingeElement1D> HingeElement1D { get; set; }
Public Property HingeElement1D As List(Of HingeElement1D)
	Get
	Set
public:
property List<HingeElement1D^>^ HingeElement1D {
	List<HingeElement1D^>^ get ();
	void set (List<HingeElement1D^>^ value);
}
Property Value
Type: List<HingeElement1D>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace